LanHikari22/delta-lab/mcu/stm32/nucleo-f410-bsp1/cube/nucleo-f410-bsp1/Inc/stm32f4xx-irqs.h
// Header file to convert STM IRQ names to Chibios vector table definitions
// Generated file, do not edit
#define WWDG_IRQHandler Vector40
#define PVD_IRQHandler Vector44
#define TAMP_STAMP_IRQHandler Vector48
#define RTC_WKUP_IRQHandler Vector4C
#define FLASH_IRQHandler Vector50
#define RCC_IRQHandler Vector54
#define EXTI0_IRQHandler Vector58
#define EXTI1_IRQHandler Vector5C
#define EXTI2_IRQHandler Vector60
#define EXTI3_IRQHandler Vector64
#define EXTI4_IRQHandler Vector68
#define DMA1_Stream0_IRQHandler Vector6C
#define DMA1_Stream1_IRQHandler Vector70
#define DMA1_Stream2_IRQHandler Vector74
#define DMA1_Stream3_IRQHandler Vector78
#define DMA1_Stream4_IRQHandler Vector7C
#define DMA1_Stream5_IRQHandler Vector80
#define DMA1_Stream6_IRQHandler Vector84
#define ADC_IRQHandler Vector88




#define EXTI9_5_IRQHandler Vector9C
#define TIM1_BRK_TIM9_IRQHandler VectorA0
#define TIM1_UP_IRQHandler VectorA4
#define TIM1_TRG_COM_TIM11_IRQHandler VectorA8
#define TIM1_CC_IRQHandler VectorAC



#define I2C1_EV_IRQHandler VectorBC
#define I2C1_ER_IRQHandler VectorC0
#define I2C2_EV_IRQHandler VectorC4
#define I2C2_ER_IRQHandler VectorC8
#define SPI1_IRQHandler VectorCC
#define SPI2_IRQHandler VectorD0
#define USART1_IRQHandler VectorD4
#define USART2_IRQHandler VectorD8

#define EXTI15_10_IRQHandler VectorE0
#define RTC_Alarm_IRQHandler VectorE4





#define DMA1_Stream7_IRQHandler VectorFC


#define TIM5_IRQHandler Vector108



#define TIM6_DAC_IRQHandler Vector118

#define DMA2_Stream0_IRQHandler Vector120
#define DMA2_Stream1_IRQHandler Vector124
#define DMA2_Stream2_IRQHandler Vector128
#define DMA2_Stream3_IRQHandler Vector12C
#define DMA2_Stream4_IRQHandler Vector130







#define DMA2_Stream5_IRQHandler Vector150
#define DMA2_Stream6_IRQHandler Vector154
#define DMA2_Stream7_IRQHandler Vector158
#define USART6_IRQHandler Vector15C








#define RNG_IRQHandler Vector180
#define FPU_IRQHandler Vector184



#define SPI5_IRQHandler Vector194









#define FMPI2C1_EV_IRQHandler Vector1BC
#define FMPI2C1_ER_IRQHandler Vector1C0
#define LPTIM1_IRQHandler Vector1C4
// End of File
